espressif/esp-idf/components/esp_hal_gpspi/esp32s2/include/hal/spi_ll.h
static inline void spi_dma_ll_tx_restart(spi_dma_dev_t *dma_out, uint32_t channel)
{
    dma_out->dma_out_link.restart = 1;
}

static inline void spi_dma_ll_rx_disable(spi_dma_dev_t *dma_in)
{
    dma_in->dma_in_link.dma_rx_ena = 0;
}

static inline void spi_dma_ll_tx_disable(spi_dma_dev_t *dma_out)
{
    dma_out->dma_out_link.dma_tx_ena = 0;
}

static inline bool spi_ll_tx_get_empty_err(spi_dev_t *hw)
{
    return hw->dma_int_raw.outfifo_empty_err;
}

/*------------------------------------------------------------------------------
 * Segmented-Configure-Transfer
 *----------------------------------------------------------------------------*/
#define SPI_LL_CONF_BUF_SET_BIT(_w, _m)  ({                                                                                        \
            (_w) |= (_m);                                                                       \
        })
#define SPI_LL_CONF_BUF_CLR_BIT(_w, _m)  ({                                                                                        \
            (_w) &= ~(_m);                                                                      \
        })

#define SPI_LL_CONF_BUF_SET_FIELD(_w, _f, val) ({                                                                                   \
            ((_w) = (((_w) & ~((_f##_V) << (_f##_S))) | (((val) & (_f##_V))<<(_f##_S))));                \
        })

#define SPI_LL_CONF_BUF_GET_FIELD(_w, _f) ({                                                                                       \
            (((_w) >> (_f##_S)) & (_f##_V));                                                                   \
        })

//This offset is 1, for bitmap
#define SPI_LL_CONF_BUFFER_OFFSET               (1)
//bitmap must be the first
#define SPI_LL_CONF_BITMAP_POS                  (0)

#define SPI_LL_CMD_REG_POS                      (0)
#define SPI_LL_ADDR_REG_POS                     (1)
#define SPI_LL_CTRL_REG_POS                     (2)
#define SPI_LL_CTRL1_REG_POS                    (3)
#define SPI_LL_CTRL2_REG_POS                    (4)
#define SPI_LL_CLOCK_REG_POS                    (5)
#define SPI_LL_USER_REG_POS                     (6)
#define SPI_LL_USER1_REG_POS                    (7)
#define SPI_LL_USER2_REG_POS                    (8)
#define SPI_LL_MOSI_DLEN_REG_POS                (9)
#define SPI_LL_MISO_DLEN_REG_POS                (10)
#define SPI_LL_MISC_REG_POS                     (11)
#define SPI_LL_SLAVE_REG_POS                    (12)
#define SPI_LL_FSM_REG_POS                      (13)
#define SPI_LL_HOLD_REG_POS                     (14)
#define SPI_LL_DMA_INT_ENA_REG_POS              (15)
#define SPI_LL_DMA_INT_RAW_REG_POS              (16)
#define SPI_LL_DMA_INT_CLR_REG_POS              (17)
#define SPI_LL_DIN_MODE_REG_POS                 (18)
#define SPI_LL_DIN_NUM_REG_POS                  (19)
#define SPI_LL_DOUT_MODE_REG_POS                (20)
#define SPI_LL_DOUT_NUM_REG_POS                 (21)
#define SPI_LL_LCD_CTRL_REG_POS                 (22)
#define SPI_LL_LCD_CTRL1_REG_POS                (23)
#define SPI_LL_LCD_CTRL2_REG_POS                (24)
#define SPI_LL_LCD_D_MODE_REG_POS               (25)
#define SPI_LL_LCD_D_NUM_REG_POS                (26)

#define SPI_LL_SCT_MAGIC_NUMBER                 (0x2)

/**
 * Set conf phase base bits len to HW for segment config trans mode.
 * need let transaction gap more than approx 2 us under different freq, calculated by driver layer.
 *
 * @param hw Beginning address of the peripheral registers.
 * @param conf_base Conf base bits len.
 */
static inline void spi_ll_set_conf_base_bitslen(spi_dev_t *hw, uint8_t conf_base)
{
    // 7 bits wide
    if (conf_base < 128) {
        hw->slv_wrbuf_dlen.conf_base_bitlen = conf_base;
    }
}

/**
 * Set conf phase bits len to HW for segment config trans mode.
 *
 * @param hw Beginning address of the peripheral registers.
 * @param conf_bitlen Value of field conf_bitslen in cmd reg.
 */
static inline void spi_ll_set_conf_phase_bits_len(spi_dev_t *hw, uint32_t conf_bitlen)
{
    if (conf_bitlen <= SPI_LL_MAX_SCT_CONF_LEN) {
        hw->cmd.conf_bitlen = conf_bitlen;
    }
}

/**
 * Set conf phase bits len to config buffer for segment config trans mode.
 *
 * @param hw Beginning address of the peripheral registers.
 * @param conf_bitlen Value of field conf_bitslen in cmd reg.
 */
static inline void spi_ll_format_conf_bitslen_buffer(spi_dev_t *hw, uint32_t conf_bitlen, uint32_t *conf_buffer)
{
    //cmd reg: conf_bitlen
    if (conf_bitlen <= SPI_LL_MAX_SCT_CONF_LEN) {
        SPI_LL_CONF_BUF_SET_FIELD(conf_buffer[SPI_LL_CMD_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_CONF_BITLEN, conf_bitlen);
    }
}

/**
 * Update the conf buffer for conf phase
 *
 * @param hw Beginning address of the peripheral registers.
 * @param is_end Is this transaction the end of this segment.
 * @param conf_buffer Conf buffer to be updated.
 */
static inline void spi_ll_format_conf_phase_conf_buffer(spi_dev_t *hw, bool is_end, uint32_t *conf_buffer)
{
    //user reg: usr_conf_nxt
    if (is_end) {
        SPI_LL_CONF_BUF_CLR_BIT(conf_buffer[SPI_LL_USER_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_USR_CONF_NXT_M);
    } else {
        SPI_LL_CONF_BUF_SET_BIT(conf_buffer[SPI_LL_USER_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_USR_CONF_NXT_M);
    }
}

/**
 * Update the line mode of conf buffer for conf phase
 *
 * @param hw Beginning address of the peripheral registers.
 * @param line_mode line mode struct of each phase.
 * @param conf_buffer Conf buffer to be updated.
 */
static inline void spi_ll_format_line_mode_conf_buff(spi_dev_t *hw, spi_line_mode_t line_mode, uint32_t *conf_buffer)
{
    conf_buffer[SPI_LL_CTRL_REG_POS + SPI_LL_CONF_BUFFER_OFFSET] &= ~SPI_LL_ONE_LINE_CTRL_MASK;
    conf_buffer[SPI_LL_USER_REG_POS + SPI_LL_CONF_BUFFER_OFFSET] &= ~SPI_LL_ONE_LINE_USER_MASK;

    switch (line_mode.cmd_lines) {
    case 2: SPI_LL_CONF_BUF_SET_BIT(conf_buffer[SPI_LL_CTRL_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_FCMD_DUAL_M); break;
    case 4: SPI_LL_CONF_BUF_SET_BIT(conf_buffer[SPI_LL_CTRL_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_FCMD_QUAD_M); break;
    case 8: SPI_LL_CONF_BUF_SET_BIT(conf_buffer[SPI_LL_CTRL_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_FCMD_OCT_M); break;
    default: break;
    }

    switch (line_mode.addr_lines) {
    case 2: SPI_LL_CONF_BUF_SET_BIT(conf_buffer[SPI_LL_CTRL_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_FADDR_DUAL_M); break;
    case 4: SPI_LL_CONF_BUF_SET_BIT(conf_buffer[SPI_LL_CTRL_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_FADDR_QUAD_M); break;
    case 8: SPI_LL_CONF_BUF_SET_BIT(conf_buffer[SPI_LL_CTRL_REG_POS + SPI_LL_CONF_BUFFER_OFFSET], SPI_FADDR_OCT_M); break;
    default: break;
    }

